// const T =require('../../public/utils')
// const strs ="$$1~330499D1560000050035266CFE6B5171~1~~12~2018196669~R11.X00~~呕吐~~1~2018196669%%18303%%急诊儿科%%夏玉莲%%9~2018196669%%2%%4941%%计算机图文报告%%人次%%0%%%%%%8.0000%%1.00%%1.00%%8.00%%0%%0%%g14020090500%%%%0%%2018196669%%2%%5023%%彩色多普勒超声常规检查(一个部位)%%次%%0%%%%%%55.0000%%1.00%%1.00%%55.00%%0%%0%%f22030100100%%%%0%%2018196669%%2%%11697%%急诊挂号诊查费加收%%次%%0%%%%%%10.0000%%1.00%%1.00%%10.00%%0%%0%%1000000000000001%%%%0%%2018196669%%2%%8989%%门诊诊查费(普通)%%次%%0%%%%%%25.0000%%1.00%%1.00%%25.00%%0%%0%%f11030000104%%%%0%%2018196669%%2%%4131%%超敏C反应蛋白测定%%项%%0%%%%%%14.0000%%1.00%%1.00%%14.00%%0%%0%%f25030101700%%%%0%%2018196669%%2%%9406%%一次性采血管针(广州阳普)%%枚%%0%%%%%%0.3300%%1.00%%1.00%%0.33%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%3869%%血液细胞自动化分析(血常规)（五分类）%%次%%0%%%%%%15.0000%%1.00%%1.00%%15.00%%0%%0%%f25010101500%%%%0%%2018196669%%2%%9401%%一次性真空采血管(紫色)(广州阳普)%%只%%0%%%%%%0.8200%%1.00%%1.00%%0.82%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%5977%%静脉采血%%次%%0%%%%%%6.2000%%1.00%%1.00%%6.20%%0%%0%%f12040000201%%%%0~自助机(新)$$"
// const strs2 ="$$02700000000000000001097  171.16.21.110~1~330499D1560000050035266CFE6B5171~1~~12~2018196669~R11.X00~~呕吐~~1~2018196669%%18303%%急诊儿科%%夏玉莲%%9~2018196669%%2%%11697%%急诊挂号诊查费加收%%次%%0%%%%%%10.0000%%1.00%%1.00%%10.00%%0%%0%%1000000000000001%%%%0%%2018196669%%2%%8989%%门诊诊查费(普通)%%次%%0%%%%%%25.0000%%1.00%%1.00%%25.00%%0%%0%%f11030000104%%%%0%%2018196669%%2%%5023%%彩色多普勒超声常规检查(一个部位)%%次%%0%%%%%%55.0000%%1.00%%1.00%%55.00%%0%%0%%f22030100100%%%%0%%2018196669%%2%%4941%%计算机图文报告%%人次%%0%%%%%%8.0000%%1.00%%1.00%%8.00%%0%%0%%g14020090500%%%%0%%2018196669%%2%%3869%%血液细胞自动化分析(血常规)（五分类）%%次%%0%%%%%%15.0000%%1.00%%1.00%%15.00%%0%%0%%f25010101500%%%%0%%2018196669%%2%%4131%%超敏C反应蛋白测定%%项%%0%%%%%%14.0000%%1.00%%1.00%%14.00%%0%%0%%f25030101700%%%%0%%2018196669%%2%%9406%%一次性采血管针(广州阳普)%%枚%%0%%%%%%0.3300%%1.00%%1.00%%0.33%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%5977%%静脉采血%%次%%0%%%%%%6.2000%%1.00%%1.00%%6.20%%0%%0%%f12040000201%%%%0%%2018196669%%2%%9401%%一次性真空采血管(紫色)(广州阳普)%%只%%0%%%%%%0.8200%%1.00%%1.00%%0.82%%0%%0%%cl120400025g%%%%0~33040032005"
// let str =T.ParaToArry(strs2)
// console.log(str)
////文件说明:门诊业务
let Mock = require('mockjs');
const T = require('../../public/utils')
let db22=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        T1:'$$0~success~000000000000000~0~B22923957~330109D156000005006C3E81D9B82B7A~30130907~徐亦明~1~01~1983-11-14~339005198311145913~330199~杭州市~6020116~杭州萧山园林集团有限公司~310~16~~0.0~1044.5~0~~0~~328.39~0.0~0.00~0~0~~$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]


});

let db9202=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        B22923957:'$$0~传入的费用明细自负比例有误~201911111933112205~0~0~提示信息：~2019-11-11 19:33:11~172.65|10.0|3.66|0|0.0|172.65|0.0|120.83|51.82|0.0|0.0|0|0.0|0|0.0|0.0|0|0.0|0.0|0.0|0|0|0|0|0|0|0|0^~1|0.03|0.0|0.83|0.83|^3|0.03|0.0|2.83|2.83|^~$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]


});

let db9203=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
        'T1|1':['有参数不正确','交易成功',0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        B22923957:'$$0~传入的费用明细自负比例有误~201911111933112205~0~0~提示信息：~2019-11-11 19:33:11~172.65|10.0|3.66|0|0.0|172.65|0.0|120.83|51.82|0.0|0.0|0|0.0|0|0.0|0.0|0|0.0|0.0|0.0|0|0|0|0|0|0|0|0^~1|0.03|0.0|0.83|0.83|^3|0.03|0.0|2.83|2.83|^~$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]



});



T22=function T22(para,a) {
    // console.log('para是',para,a)
    //调用函数将参数转换为数组
    // para =Tools.ParaToArry(para)
    para =T.ParaToArry(para)
    // console.log('请求参数转换结果是',para)
    // console.log('卡号是',  para[0])


    // console.log('看看数据',db)


    //在db.resdata中查找卡号符合的数据并返回
    for (let i in db22.resdata[0]){
        // console.log('打印一下',i,db.resdata[0][i])
        //当前循环到的
        let current = db22.resdata[0][i]

        //判断是否有数据
        if(current.length>0){
            //转换数组
            let arry =T.ParaToArry(current)
            console.log('22转换后的结果',arry)
            console.log('22长度',arry.length)


            //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
            let sfz1=arry[11]
            console.log('数据身份证号：',sfz1)

            //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
            let sfz2=para[14]
            console.log('入参身份证号：',sfz2)

            //如果找到符合的将当前找到的数据返回
            if(sfz1 === sfz2){
                console.log('22找到并返回返回参数',current)
                return current;

            }else {
                console.log('22未找到并返回返回参数')
                let re ="$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$";
                // res.status(200).json('$$-1&&');
                return re
            }
        }


    }

}


//读卡，需要根据卡号获取 第四位的
T27=function T9202(para, a) {

    console.log('T9202预结算入参:',para)
    para=T.ParaToArry(para)
    console.log('T9202社会保障卡卡号',  para[4])
    console.log('转换后结果',  para)
    // let res = db9202.resdata[0][para[4]]
    let res = db9202.resdata[0][para[4]]
    console.log('入参的卡号',para[4])
    if( res != null){
        console.log('T9202预结算返回参数',  res)
        let pp=T.ParaToArry(res)
        console.log('参数是什么',pp)
        return res
    }else {
        return '$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$'
        console.log('未找到病人')
    }


    //在db.resdata中查找卡号符合的数据并返回
    // for (let i in db9202.resdata[0]){
    //     // console.log('打印一下',i,db.resdata[0][i])
    //     //当前循环到的
    //     let current = db9202.resdata[0][i]
    //
    //     //判断是否有数据
    //     if(current.length>0){
    //         //转换数组
    //         let arry =T.ParaToArry(current)
    //         console.log('读卡函数转换后的arry:',arry)
    //
    //         //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
    //         let cardnum1=arry[3]
    //         // console.log('卡1',cardnum1)
    //
    //         //读取入参数据中，对应的卡号，数组从0开始
    //         let cardnum2=para
    //
    //         //如果找到符合的将当前找到的数据返回
    //         if(cardnum1==cardnum2){
    //             // console.log('22找到并返回返回参数',current)
    //             return current;
    //
    //         }else {
    //             let re ='$$-1&&'
    //             // res.status(200).json('$$-1&&');
    //             return re
    //         }
    //     }
    //
    //
    // }

}


//读卡，需要根据卡号获取 第四位的
T28=function T9203(para, a) {

    console.log('T9203预结算入参:',para)
    para=T.ParaToArry(para)
    // console.log('T9203社会保障卡卡号',  para[4])
    // console.log('转换后结果',  para)
    // let res = db9203.resdata[0][para[4]]
    let res = db9202.resdata[0][para[4]]
    console.log('入参的卡号',para[4])
    if( res != null){
        console.log('T9203预结算返回参数',  res)
        return res
    }else {
        return '$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$'
        console.log('未找到病人')
    }


    //在db.resdata中查找卡号符合的数据并返回
    // for (let i in db9202.resdata[0]){
    //     // console.log('打印一下',i,db.resdata[0][i])
    //     //当前循环到的
    //     let current = db9202.resdata[0][i]
    //
    //     //判断是否有数据
    //     if(current.length>0){
    //         //转换数组
    //         let arry =T.ParaToArry(current)
    //         console.log('读卡函数转换后的arry:',arry)
    //
    //         //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
    //         let cardnum1=arry[3]
    //         // console.log('卡1',cardnum1)
    //
    //         //读取入参数据中，对应的卡号，数组从0开始
    //         let cardnum2=para
    //
    //         //如果找到符合的将当前找到的数据返回
    //         if(cardnum1==cardnum2){
    //             // console.log('22找到并返回返回参数',current)
    //             return current;
    //
    //         }else {
    //             let re ='$$-1&&'
    //             // res.status(200).json('$$-1&&');
    //             return re
    //         }
    //     }
    //
    //
    // }

}

T49=function(para) {
    console.log('T9247交易作废入参:',para)
    para=T.ParaToArry(para)
    // console.log('T9203社会保障卡卡号',  para[4])
    // console.log('转换后结果',  para)
    let res  = Mock.mock({'T0|1':['$$0~交易成功$$','$$-1~交易失败$$']});//根据随机值返回
    res=res['T0']
    console.log('T9247交易作废返回参数:',res)
    return res
}



module.exports={
    T22,
    T27,
    T28,
    T49,
}
