// const T =require('../../public/utils')
// const strs ="$$1~330499D1560000050035266CFE6B5171~1~~12~2018196669~R11.X00~~呕吐~~1~2018196669%%18303%%急诊儿科%%夏玉莲%%9~2018196669%%2%%4941%%计算机图文报告%%人次%%0%%%%%%8.0000%%1.00%%1.00%%8.00%%0%%0%%g14020090500%%%%0%%2018196669%%2%%5023%%彩色多普勒超声常规检查(一个部位)%%次%%0%%%%%%55.0000%%1.00%%1.00%%55.00%%0%%0%%f22030100100%%%%0%%2018196669%%2%%11697%%急诊挂号诊查费加收%%次%%0%%%%%%10.0000%%1.00%%1.00%%10.00%%0%%0%%1000000000000001%%%%0%%2018196669%%2%%8989%%门诊诊查费(普通)%%次%%0%%%%%%25.0000%%1.00%%1.00%%25.00%%0%%0%%f11030000104%%%%0%%2018196669%%2%%4131%%超敏C反应蛋白测定%%项%%0%%%%%%14.0000%%1.00%%1.00%%14.00%%0%%0%%f25030101700%%%%0%%2018196669%%2%%9406%%一次性采血管针(广州阳普)%%枚%%0%%%%%%0.3300%%1.00%%1.00%%0.33%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%3869%%血液细胞自动化分析(血常规)（五分类）%%次%%0%%%%%%15.0000%%1.00%%1.00%%15.00%%0%%0%%f25010101500%%%%0%%2018196669%%2%%9401%%一次性真空采血管(紫色)(广州阳普)%%只%%0%%%%%%0.8200%%1.00%%1.00%%0.82%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%5977%%静脉采血%%次%%0%%%%%%6.2000%%1.00%%1.00%%6.20%%0%%0%%f12040000201%%%%0~自助机(新)$$"
// const strs2 ="$$02700000000000000001097  171.16.21.110~1~330499D1560000050035266CFE6B5171~1~~12~2018196669~R11.X00~~呕吐~~1~2018196669%%18303%%急诊儿科%%夏玉莲%%9~2018196669%%2%%11697%%急诊挂号诊查费加收%%次%%0%%%%%%10.0000%%1.00%%1.00%%10.00%%0%%0%%1000000000000001%%%%0%%2018196669%%2%%8989%%门诊诊查费(普通)%%次%%0%%%%%%25.0000%%1.00%%1.00%%25.00%%0%%0%%f11030000104%%%%0%%2018196669%%2%%5023%%彩色多普勒超声常规检查(一个部位)%%次%%0%%%%%%55.0000%%1.00%%1.00%%55.00%%0%%0%%f22030100100%%%%0%%2018196669%%2%%4941%%计算机图文报告%%人次%%0%%%%%%8.0000%%1.00%%1.00%%8.00%%0%%0%%g14020090500%%%%0%%2018196669%%2%%3869%%血液细胞自动化分析(血常规)（五分类）%%次%%0%%%%%%15.0000%%1.00%%1.00%%15.00%%0%%0%%f25010101500%%%%0%%2018196669%%2%%4131%%超敏C反应蛋白测定%%项%%0%%%%%%14.0000%%1.00%%1.00%%14.00%%0%%0%%f25030101700%%%%0%%2018196669%%2%%9406%%一次性采血管针(广州阳普)%%枚%%0%%%%%%0.3300%%1.00%%1.00%%0.33%%0%%0%%cl120400025g%%%%0%%2018196669%%2%%5977%%静脉采血%%次%%0%%%%%%6.2000%%1.00%%1.00%%6.20%%0%%0%%f12040000201%%%%0%%2018196669%%2%%9401%%一次性真空采血管(紫色)(广州阳普)%%只%%0%%%%%%0.8200%%1.00%%1.00%%0.82%%0%%0%%cl120400025g%%%%0~33040032005"
// let str =T.ParaToArry(strs2)
// console.log(str)
////文件说明:门诊业务
let Mock = require('mockjs');
const T = require('../../public/utils')
let db22=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        T1:'$$0~~~~~330499D1560000050035266CFE6B5171%%4001914672%%徐浩庭%%1%%01%%20160116%%330402201601160619%%无%%(医)建设--南杨社区%%330402%%南湖区%%99%%000%%0%%0%%0%%%%0%%0%%0%%1606.49%%0%%0%%142.66%%0%%0%%0%%0%%0%%%%25%%0~000000011000100~100110000000000~100000000000000~A88399353$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]


});

let db27=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        '330499D1560000050035266CFE6B5171':'$$0~~~~~~0~20191111 031907~134.35%%23.5%%0%%110.85%%0%%0%%31%%77.26%%108.26%%26.09%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%26.09%%0%%0~~~226727430$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]


});

let db28=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
        'T1|1':['有参数不正确','交易成功',0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        '330499D1560000050035266CFE6B5171':'$$0~~~~~0~0~20191111 031959~226727431~134.35%%23.5%%0%%110.85%%0%%0%%31%%77.26%%108.26%%26.09%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%0%%26.09%%0%%0~05%%普通门诊一般诊查费统筹优先%%25%%17.5%%.7%%7.5%%0%%06%%先自费费用%%23.5%%0%%0%%0%%23.5%%21%%统筹第一段%%85.85%%8.59%%.1%%77.26%%0~$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]



});


let db49=Mock.mock({
    'data|1':[{
        'T0|1':[1,-1,0],
        'T1|1':['有参数不正确','交易成功',0],
    }],
    'resdata':[{
        'T0|1':[1,-1,0],
        T1:'$$0~~~~~226773857$$',
        T2:'',
        T3:'',
        T4:'',
        T5:'',
        T6:'',
        T7:'',
        T8:'',
        T9:'',
        T10:'',
        T11:'',
        T12:'',
        T13:'',
        T14:'',
        T15:'',
        T16:'',
        T17:'',
        T18:'',
        T19:'',
        T20:'',
        T21:'',
        T22:'',
        T23:'',
        T24:'',
        T25:'',
        T26:'',
        T27:'',
        T28:'',
        T29:'',
        T30:'',
        T31:'',
        T32:'',
    }]



});



T22=function T22(para,a) {
    // console.log('para是',para,a)
    //调用函数将参数转换为数组
    // para =Tools.ParaToArry(para)
    para =T.ParaToArry(para)
    // console.log('请求参数转换结果是',para)
    // console.log('卡号是',  para[0])


    // console.log('看看数据',db)


    //在db.resdata中查找卡号符合的数据并返回
    for (let i in db22.resdata[0]){
        // console.log('打印一下',i,db.resdata[0][i])
        //当前循环到的
        let current = db22.resdata[0][i]

        //判断是否有数据
        if(current.length>0){
            //转换数组
            let arry =T.ParaToArry(current)
            console.log('22转换后的结果',arry)
            console.log('22长度',arry.length)


            //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
            let sfz1=arry[5][0]
            console.log('数据社会保障卡号：',sfz1)

            //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
            let sfz2=para[1]
            console.log('入参社会保障卡号：',sfz2)

            //如果找到符合的将当前找到的数据返回
            if(sfz1 === sfz2){
                console.log('22找到并返回返回参数',current)
                return current;

            }else {
                console.log('22未找到并返回返回参数')
                let re ="$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$";
                // res.status(200).json('$$-1&&');
                return re
            }
        }


    }

}


//读卡，需要根据卡号获取 第四位的
T27=function T27(para, a) {

    console.log('T27预结算入参:',para)
    para=T.ParaToArry(para)
    console.log('T27社会保障卡卡号',  para[1])
    console.log('转换后结果',  para)
    // let res = db27.resdata[0][para[4]]
    let res = db27.resdata[0][para[1]]
    console.log('入参的卡号',para[1])
    if( res != null){
        console.log('T27预结算返回参数',  res)
        let pp=T.ParaToArry(res)
        console.log('参数是什么',pp)
        return res
    }else {
        return '$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$'
        console.log('未找到病人')
    }


    //在db.resdata中查找卡号符合的数据并返回
    // for (let i in db27.resdata[0]){
    //     // console.log('打印一下',i,db.resdata[0][i])
    //     //当前循环到的
    //     let current = db27.resdata[0][i]
    //
    //     //判断是否有数据
    //     if(current.length>0){
    //         //转换数组
    //         let arry =T.ParaToArry(current)
    //         console.log('读卡函数转换后的arry:',arry)
    //
    //         //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
    //         let cardnum1=arry[3]
    //         // console.log('卡1',cardnum1)
    //
    //         //读取入参数据中，对应的卡号，数组从0开始
    //         let cardnum2=para
    //
    //         //如果找到符合的将当前找到的数据返回
    //         if(cardnum1==cardnum2){
    //             // console.log('22找到并返回返回参数',current)
    //             return current;
    //
    //         }else {
    //             let re ='$$-1&&'
    //             // res.status(200).json('$$-1&&');
    //             return re
    //         }
    //     }
    //
    //
    // }

}


//读卡，需要根据卡号获取 第四位的
T28=function T28(para, a) {

    console.log('T28预结算入参:',para)
    para=T.ParaToArry(para)
    // console.log('T28社会保障卡卡号',  para[4])
    // console.log('转换后结果',  para)
    // let res = db28.resdata[0][para[4]]
    let res = db28.resdata[0][para[1]]
    console.log('T28入参的卡号',para[1])
    if( res != null){
        console.log('T28预结算返回参数',  res)
        return res
    }else {
        return '$$-1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~$$'
        console.log('未找到病人')
    }


    //在db.resdata中查找卡号符合的数据并返回
    // for (let i in db9202.resdata[0]){
    //     // console.log('打印一下',i,db.resdata[0][i])
    //     //当前循环到的
    //     let current = db9202.resdata[0][i]
    //
    //     //判断是否有数据
    //     if(current.length>0){
    //         //转换数组
    //         let arry =T.ParaToArry(current)
    //         console.log('读卡函数转换后的arry:',arry)
    //
    //         //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11
    //         let cardnum1=arry[3]
    //         // console.log('卡1',cardnum1)
    //
    //         //读取入参数据中，对应的卡号，数组从0开始
    //         let cardnum2=para
    //
    //         //如果找到符合的将当前找到的数据返回
    //         if(cardnum1==cardnum2){
    //             // console.log('22找到并返回返回参数',current)
    //             return current;
    //
    //         }else {
    //             let re ='$$-1&&'
    //             // res.status(200).json('$$-1&&');
    //             return re
    //         }
    //     }
    //
    //
    // }

}

T49=function(para) {
    console.log('T49交易作废入参:',para)
    para=T.ParaToArry(para)
    console.log('T49交易作废转换后入参:',para)
    console.log('T49医保交易流水号：',  para[5])
    // console.log('转换后结果',  para)

    //在db49.resdata中查找卡号符合的数据并返回
    for (let i in db49.resdata[0]){
        // console.log('打印一下',i,db.resdata[0][i])
        //当前循环到的
        let current = db49.resdata[0][i]
        // let test =T.isContain(1,['22',1,'11'])
        // console.log('测试函数',test)
        //判断是否有数据
        if(current.length>0){
            //转换数组
            let arry =T.ParaToArry(current)
            console.log('转换后的入参:',para)
            console.log('转换后的数据库数据:',arry)


            //读取mock产生的数据中，12号的参数身份证号码，数组从0开始所以是11


            //读取入参数据中，对应的卡号，数组从0开始
            let cardnum2=para[5]
            console.log('医保交易流水号-入参:',cardnum2)

            let cardnum1=arry[5]
            console.log('医保交易流水号-数据库匹配到:',cardnum1)

            //如果找到符合的将当前找到的数据返回
            if(cardnum1==cardnum2){
                // console.log('22找到并返回返回参数',current)
                return current;

            }else {
                let re ='$$-1&&'
                // res.status(200).json('$$-1&&');
                return re
            }
        }


    }
}



module.exports={
    T22,
    T27,
    T28,
    T49,
}
